solutions_quantum/data4diagrams/README.org
#+TITLE: Figures for the extended version of the paper
#+AUTHOR: Koniorczyk et al.

- WORK IN PROGRESS

- DO NOT EDIT README.txt, it is for compatibility.
  The README is README.org

* What I have so far

** List all train path in a quantum solution

e.g. realisation 1 in ~cqm5_case3_Integer.pkl~

#+BEGIN_SRC bash 
./read_quantum_pickle.py cqm5_case3_Integer.pkl 1
#+END_SRC

Assumptions:

*Krzysziek, please verify if this is correct!*

- The ~arrive~ and ~departure~ fields reflect the *modified* train paths
  from the optimization.
- The *original*, i.e. originally planned train paths are obtained by
  substracting the ~secondary_delay~ field values in minutes from the
  ~arrive~ and ~departure~ fields' contents.
- The *conflicted* train paths come from the ~conflicted_arrive~ and
  ~conflicted_departure~ fields.
  
* Demonstrate space (horizontal) axis

#+BEGIN_SRC bash
./tmp_echo_xaxis_gnuplot.py > tmp.gnuplot
gnuplot tmp.gnuplot
#+END_SRC 

* Line segments

My plan is to draw diagrams for 2 line segments, containing the
following stations each:

| GLC     | Gliwice                   |
| ZZ      | Zabrze                    |
| RŚl     | Ruda Śląska               |
| RCB     | Ruda Chebzie              |
|         | Świętochłowice            |
| CB      | Chorzów Batory            |
| KTC     | Katowice Towarowa KTC     |
| KO      | Katowice                  |
| KO(STM) | Katowice Stacja Manewrowa |
| KZ      | Katowice Zawodzie         |

and

| KZ      | Katowice Zawodzie         |
| KO(STM) | Katowice Stacja Manewrowa |
| KO      | Katowice                  |
| Bry     | Katowice Brynów           |
| KL      | Katowice Ligota           |
| KtP     | Katowice Piotrowice       |
|         | Katowice Podlesie         |
| Mc      | Mąkołowiec                |
| Ty      | Tychy                     |

In the two figures, only the part of the train paths fitting to these
segments will appear.

* Next step

- Do the first figures
